## Data Cleaning assignment

In [ ]:
import pandas as pd
import numpy as np


1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [ ]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [ ]:
df['FlightNumber'][1]=df['FlightNumber'][0]+10
df['FlightNumber'][3]=df['FlightNumber'][2]+10
df

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [ ]:
df['FlightNumber']=df['FlightNumber'].astype(int)

In [ ]:

df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [ ]:
df['FlightNumber'].dtype

dtype('int64')

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [ ]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [ ]:
df1 = pd.DataFrame({'Source': ['LoNDon', 'MAdrid',
'londON',

'Budapest', 'Brussels'],
'Destination': ['paris','miLAN','StockhOlm','PaRis','londOn	']})
df1

     Source Destination
0    LoNDon       paris
1    MAdrid       miLAN
2    londON   StockhOlm
3  Budapest       PaRis
4  Brussels    londOn\t

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [ ]:
df1['Source']=df1['Source'].str.capitalize()
df1['Destination']=df1['Destination'].str.capitalize()
df1

     Source Destination
0    London       Paris
1    Madrid       Milan
2    London   Stockholm
3  Budapest       Paris
4  Brussels    London\t

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [ ]:
df.drop('From_To',axis=1,inplace=True)

In [ ]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [ ]:
df=pd.concat([df,df1],axis=1)

In [ ]:
df.columns.values

array(['FlightNumber', 'RecentDelays', 'Airline', 'Source', 'Destination'],
      dtype=object)

In [ ]:
cols=['Source', 'Destination','FlightNumber', 'RecentDelays', 'Airline']

In [ ]:
df=df[cols]

In [ ]:
df

     Source Destination  FlightNumber  RecentDelays              Airline
0    London       Paris         10045      [23, 47]               KLM(!)
1    Madrid       Milan         10055            []    <Air France> (12)
2    London   Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest       Paris         10075          [13]       12. Air France
4  Brussels    London\t         10085      [67, 32]          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [ ]:
df

     Source Destination  FlightNumber  RecentDelays              Airline
0    London       Paris         10045      [23, 47]               KLM(!)
1    Madrid       Milan         10055            []    <Air France> (12)
2    London   Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest       Paris         10075          [13]       12. Air France
4  Brussels    London\t         10085      [67, 32]          "Swiss Air"

In [ ]:
df2=pd.DataFrame(df['RecentDelays'].values.tolist())

In [ ]:
df2

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [ ]:
cols_1 = ['Delay_1','Delay_2','Delay_3']

In [ ]:
df2.columns=cols_1

In [ ]:
df2

   Delay_1  Delay_2  Delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [ ]:
df=pd.concat([df,df2],axis=1)

In [ ]:
df

     Source Destination  FlightNumber  ... Delay_1 Delay_2  Delay_3
0    London       Paris         10045  ...    23.0    47.0      NaN
1    Madrid       Milan         10055  ...     NaN     NaN      NaN
2    London   Stockholm         10065  ...    24.0    43.0     87.0
3  Budapest       Paris         10075  ...    13.0     NaN      NaN
4  Brussels    London\t         10085  ...    67.0    32.0      NaN

[5 rows x 8 columns]

In [ ]:
df.drop('RecentDelays',axis=1,inplace=True)

In [ ]:
df

     Source Destination  FlightNumber  ... Delay_1  Delay_2  Delay_3
0    London       Paris         10045  ...    23.0     47.0      NaN
1    Madrid       Milan         10055  ...     NaN      NaN      NaN
2    London   Stockholm         10065  ...    24.0     43.0     87.0
3  Budapest       Paris         10075  ...    13.0      NaN      NaN
4  Brussels    London\t         10085  ...    67.0     32.0      NaN

[5 rows x 7 columns]